<a href="https://colab.research.google.com/github/tbonne/peds/blob/main/docs/introData/IntroData1_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src='http://drive.google.com/uc?export=view&id=1RkQNovXbpa5a43mEAIpdWlL_ungUN-8j' width="300" align = 'center'>

***

# <font color='darkorange'>Introduction to DataFrames</font>

In this exercise we will introduce **dataframes** which are objects in python that we will work a lot with in this class. These **dataframes** will be how we work with data, and get the data ready for visualizing and modeling.

Outline:


*   Creating dataframes
*   Selecting from DataFrames
*   Creating new columns
*   Filtering rows
*   DataFrame functions

We'll be using the **Pandas** library to do most of this work. Let's take a look at how to create and modify dataframes using **Pandas**!

## <font color='darkorange'>Creating DataFrames</font>

In [1]:
#import python libraries that we will use
import numpy as np
import pandas as pd

Create a dataframe from scratch

In [2]:

## create a dictionary
d = {'A':[1,2,3,4], 'B':[5,6,7,8] }

## convert the dictionary to a dataframe
df_test = pd.DataFrame(data=d)

#take a look at the dataframe
df_test

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

Add a column to the data frame

In [3]:
#add list of names
df_test['ID'] = ['Steve','Sarojini','Emil','Sarah']

#add country
df_test['country'] = 'Canada'

#take a look (notice how it filled in the country!)
df_test

   A  B        ID country
0  1  5     Steve  Canada
1  2  6  Sarojini  Canada
2  3  7      Emil  Canada
3  4  8     Sarah  Canada

All dataframes also have an index, which keeps track of what data is in each row/column.

In [4]:
#index of the rows
df_test.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
#index of the columns
df_test.columns

Index(['A', 'B', 'ID', 'country'], dtype='object')

## <font color='darkorange'>Selecting from a Dataframe</font>

In [6]:
#take a look at the full dataframe
df_test

   A  B        ID country
0  1  5     Steve  Canada
1  2  6  Sarojini  Canada
2  3  7      Emil  Canada
3  4  8     Sarah  Canada

In [7]:
#grab the A column
df_test['A']

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [8]:
#or similarly grab the A column
df_test.A

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [9]:
#grab the first three rows
df_test[0:3]

   A  B        ID country
0  1  5     Steve  Canada
1  2  6  Sarojini  Canada
2  3  7      Emil  Canada

It is also possible to select by slicing similar to the numpy array! 
> Here we use the method **loc** with square brackets to select rows and columns 
[rows , columns] with the similar slicing [start:stop:steps]. The **loc** method uses the index and the column names of the dataframe.

Below we take the first three rows and only the A and B columns:

In [10]:
#first three rows and the A and B columns
df_test.loc[ 0:2 , ["A","B"] ]

   A  B
0  1  5
1  2  6
2  3  7

<img src='http://drive.google.com/uc?export=view&id=1WC4tXGCEF-1_2LQ74gIxJAZ-GLXCwBdK' width="100" align = 'left'>  
<br>
<br>
<br>
Let's try out what you've learnt. Try and select the ID and Country columns and only the third row:

In [11]:
#ID and country columns, and the third row
df_test.loc[2,['ID','country']]

ID           Emil
country    Canada
Name: 2, dtype: object

## <font color='darkorange'>Selecting from a Dataframe: using positions</font>

In [12]:
#full dataframe
df_test

   A  B        ID country
0  1  5     Steve  Canada
1  2  6  Sarojini  Canada
2  3  7      Emil  Canada
3  4  8     Sarah  Canada

In [13]:
#first three rows and the second and thrid columns - using :
df_test.iloc[0:3,1:3]

   B        ID
0  5     Steve
1  6  Sarojini
2  7      Emil

In [14]:
#second, and fourth rows, and second and fourth columns - using lists
df_test.iloc[ [1,3] , [1,3] ]

   B country
1  6  Canada
3  8  Canada

<img src='http://drive.google.com/uc?export=view&id=1WC4tXGCEF-1_2LQ74gIxJAZ-GLXCwBdK' width="100" align = 'left'>  
<br>
<br>
<br>
Try and select the ID and Country columns and only the third row using iloc:

In [15]:
#ID and country columns, and the third row
df_test.iloc[2, 2:4]

ID           Emil
country    Canada
Name: 2, dtype: object

## <font color='darkorange'>Creating new variables</font>

In [16]:

#multiply the B column by 4 to create a new variable C
df_test['C'] = df_test['B'] * 4

#multiply the C column by A to create a new variable D
df_test['D'] = df_test['C'] * df_test['A']

#take a look
df_test

   A  B        ID country   C    D
0  1  5     Steve  Canada  20   20
1  2  6  Sarojini  Canada  24   48
2  3  7      Emil  Canada  28   84
3  4  8     Sarah  Canada  32  128

## <font color='darkorange'>Filtering DataFrames</font>

Keep only the rows/columns that you'd like

In [17]:
#keep only the rows where A is less than 3
df_test_sub = df_test[df_test.A<3]

#keep only the columns A and ID
df_test_sub = df_test_sub[['A','B']]

#take a look
df_test_sub

   A  B
0  1  5
1  2  6

<img src='http://drive.google.com/uc?export=view&id=1WC4tXGCEF-1_2LQ74gIxJAZ-GLXCwBdK' width="100" align = 'left'>  
<br>
<br>
<br>
Add the C and D columns together and select only the rows with values greater than 100:

In [18]:
#Add the columns C and D together
df_test['E'] = df_test['C'] + df_test['D']

#keep only the rows where D is greater than 100
df_test_100 = df_test[df_test.E>100]

#take a look
df_test_100

   A  B     ID country   C    D    E
2  3  7   Emil  Canada  28   84  112
3  4  8  Sarah  Canada  32  128  160

## <font color='darkorange'>Dataframe functions</font>

When we create a dataframe we are creating an object, and this dataframe object has functions built in. Let's take a look at a few now, and we will see more as we go along in this course. 

Try just typing df_test. 

After typing the "." you should see the list of functions available to you once you've created a dataframe object.

In [19]:
df_test.

SyntaxError: invalid syntax (<ipython-input-19-abcc6e4f2406>, line 1)

One useful function is the *dtypes* function. It will tell us what data type is in each column.

In [20]:
#What data type is stored in each column
df_test.dtypes

A           int64
B           int64
ID         object
country    object
C           int64
D           int64
E           int64
dtype: object

The *sum* function is very useful for quickly summing up the values in a column.

In [21]:
#What is the sum of the A column
df_test.A.sum()

10

The *?* is a very useful function in general, and can provide us with useful information about most objects.

In [22]:
#find help on functions, objects, ... etc
?df_test

Type:        DataFrame
String form:
   A  B        ID country   C    D    E
0  1  5     Steve  Canada  20   20   40
1  2  6  Sarojini  Canada  24   48   72
2  3  7      Emil  Canada  28   84  112
3  4  8     Sarah  Canada  32  128  160
Length:      4
File:        ~/opt/anaconda3/envs/adhd/lib/python3.8/site-packages/pandas/core/frame.py
Docstring:
Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns).
Arithmetic operations align on both row and column labels. Can be
thought of as a dict-like container for Series objects. The primary
pandas data structure.

Parameters
----------
data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
    Dict can contain Series, arrays, constants, dataclass or list-like objects. If
    data is a dict, column order follows insertion-order.

    .. versionchanged:: 0.25.0
       If data is a list of dicts, column order follows insertion-order.

index : Index or array-like
    Index to use for resulting frame. Will default to RangeIndex if
    no indexing information part of input data and no index provided.
columns : Index or array-like
    Column labels to use for resulting frame. Will default to
    RangeIndex (0, 1, 2, ..., n) if no column labels are provided.
dtype : dtype, default None
    Data type to force. Only a single dtype is allowed. If None, infer.
copy : bool, default False
    Copy data from inputs. Only affects DataFrame / 2d ndarray input.

See Also
--------
DataFrame.from_records : Constructor from tuples, also record arrays.
DataFrame.from_dict : From dicts of Series, arrays, or dicts.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_table : Read general delimited file into DataFrame.
read_clipboard : Read text from clipboard into DataFrame.

Examples
--------
Constructing DataFrame from a dictionary.

>>> d = {'col1': [1, 2], 'col2': [3, 4]}
>>> df = pd.DataFrame(data=d)
>>> df
   col1  col2
0     1     3
1     2     4

Notice that the inferred dtype is int64.

>>> df.dtypes
col1    int64
col2    int64
dtype: object

To enforce a single dtype:

>>> df = pd.DataFrame(data=d, dtype=np.int8)
>>> df.dtypes
col1    int8
col2    int8
dtype: object

Constructing DataFrame from numpy ndarray:

>>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
...                    columns=['a', 'b', 'c'])
>>> df2
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Constructing DataFrame from dataclass:

>>> from dataclasses import make_dataclass
>>> Point = make_dataclass("Point", [("x", int), ("y", int)])
>>> pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])
    x  y
0  0  0
1  0  3
2  2  3

## <font color='darkorange'>Further reading</font>

Pandas quick intro:
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
</br>
Pandas longer intro:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html
  
> If you would like the notebook without missing code check out the [full code](https://colab.research.google.com/github/tbonne/peds/blob/main/docs/fullNotebooks/full_IntroNumpy.ipynb) version.